# ไม่เปลี่ยนเลย (Best Luck) | fellow fellow
import time

# กำหนดตัวแปรlyricsเป็นTuple เก็บTupleเนื้อร้องแต่ละบรรทัดและค่าหน่วงเวลา
lyrics = (
    ("โชคดีเหลือเกิน ที่เราได้เจอกัน", 3),
    ("โชคดีที่เธอ ยังยอมอยู่ข้างฉัน", 3.5),
    ("ไหนใครว่าเวลาเปลี่ยนไป", 3.5),
    ("หัวใจใครๆมักเปลี่ยนแปลง", 3.5),
    ("โชคดีเหลือเกิน ที่เรายังมีกัน", 3),
    ("ทุกช่วงเวลา เธอยังอยู่ข้างฉัน", 3),
    ("ไหนว่าผู้คนมักเปลี่ยนไป", 3),
    ("โชคดีที่หัวใจ ของเราไม่เคยเปลี่ยนเลย", 3),
    ("\033[38;2;255;165;0m-- ไม่เปลี่ยนเลย (Best Luck) | fellow fellow --\033[0m", 0)
)

# loop ในตัวแปล lyrics
for line, delay in lyrics:
    # loop ตัวอักษรในแต่ละบรรทัด
    for char in line:
        print(char, end='') #แสดงเนื้อเพลง
    print() # แสดงผลบรรทัดใหม่
    print() # เว้นบรรทัดใหม่
    time.sleep(delay) # หน่วงเวลาแต่ละบรรทัด
